# Отчет по лабораторной работе N 14 по курсу
# "Фундаментальная информатика"

Студентка группы: M8О-113Б, Соломатина Светлана Викторовна\
Контакты: ssolomvi@gmail.com\
Работа выполнена: 16.11.2021\
Преподаватель: Довженко Анастасия Александровна

## 1. Тема

Вложенные циклы с параметрами. Обход и линеаризация матриц

## 2. Цель работы

Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном порядке следования

## 3. Задание

Вариант 27. Вывести в строку все элементы матрицы в заданном порядке следования.

| 10 | 11 | 12 | 1 |
|---|---|---|----|
| 9 | 16 | 13 | 2 |
| 8 | 15 | 14 | 3 |
| 7 | 6 | 5 | 4 |

## 4. Оборудование

Процессор: AMD Ryzen 5 4500U with Radeon Graphics 2.38 GHz\
ОП: 16384 Мб\
НМД: 512 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **21.04**\
Интерпретатор команд: **bash**, версия **5.1.4**.\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **/home/ssolomvi**

## 6. Идея, метод, алгоритм решения задачи

Создать условие, при котором программа начнёт вывод введённой матрицы с верхнего правого угла, пока не дойдёт до нижней границы матрицы, после чего будет выводить значения вплоть до левой границы матрицы, далее -- до верхней, наконец, до крайней правой, исключая уже выведенные значения. Условную конструкцию на обход матрицы задать с учётом способа обхода матрицы, а именно здесь в направлении обхода нижняя и правая границы будут "сужаться", верхняя и правая -- "расширяться".

## 7. Сценарий выполнения работы

1. Изучить материалы лекции, примеры, приведённые в методическом пособии
2. Составить алгоритм обхода матрицы
3. Написать программу на Си
4. Провести тесты
5. Запротоколировать сеанс

| Тест  | Ввод | Вывод |
|----|:-------------|---------------:|
| 1  | 2 4 <br/> 4 <br/>10 11 12  1 <br/>9 16 13  2<br/>8 15 14  3<br/>7  6  5  4<br/>1<br/>1000  | 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16<br/>1000 |
| 2  | 1 6<br/>6<br/>0 50 18  6 35 14<br/>12 25 50 25 23 48<br/>11 15 14 17 21 44<br/>42 10 29 23 12  8<br/>38 29  2 10 35 44<br/>29 21 15  1 45  5| 14 48 44 8 44 5 45 1 15 21 29 38 42 11 12 0 50 18 6 35 23 21 12 35 10 2 29 10 15 25 50 25 17 23 29 14 |
| 3  | 0 |  |
| 4  | 3 3<br/>1<br/>0<br/>2<br/>0 1<br/>2 3<br/>3<br/>0 1 2<br/>3 4 5<br/>6 7 8 | 0<br/>1 3 2 0<br/>2 5 8 7 6 3 0 1 4|

## 8. Распечатка протокола

```C
#include <stdio.h>

void space(int kos2)
{
    if (kos2 != 1) {
        putchar(' ');
    }
}

int main(void)
{
    int k, kos;
    scanf("%d", &k);
    if (k == 0) {
        return 0;
    }
    scanf("%d", &kos);

    while (k > 0) {
        int size;
        scanf("%d", &size);
        int kos2 = size * size;
        int array[size][size];

        for (int i = 0; i < size; ++i) {
            for (int j = 0; j < size; ++j) {
                scanf("%d", &array[i][j]);
            }
        }

        int upper_border = 0, down_border = size, right_border = size, left_border = 0;

        while (down_border - upper_border > 0 || right_border - left_border > 0) {
            for (int j = upper_border; j < down_border; j++) {
                printf("%d", array[j][right_border - 1]);
                space(kos2);
                kos2--;
            }
            right_border--;
            for (int j = right_border - 1; j >= left_border; j--) {
                printf("%d", array[down_border - 1][j]);
                space(kos2);
                kos2--;
            }
            down_border--;
            for (int j = down_border - 1; j >= upper_border; j--) {
                printf("%d", array[j][left_border]);
                space(kos2);
                kos2--;
            }
            left_border++;
            for (int j = left_border; j < right_border; j++) {
                printf("%d", array[upper_border][j]);
                space(kos2);
                kos2--;
            }
            upper_border++;
        }
        k--;
    }
    return 0;
}
```

## 9. Дневник отладки

| №  | Лаб. или дом. | Дата       | Время | Событие   | Действие по исправлению | Примечание          |
|----|---------------|------------|-------|-----------|-------------------------|---------------------|
| 0  | Дом.          | 16.11.2021 | 21:30 | --        | --                      | Всё прошло исправно |

## 10. Замечания автора по существу работы

Выяснила, что матрицы являются удобным и наглядным способом представлять данные в некоторых задачах, в орпеделённых случаях их использование будет целесообразнее использования массивов.

## 11. Выводы

Научилась создавать матрицы, обращаться к её отдельным элементам, заполнять матрицу при помощи цикла и делать по ней обход в определённом порядке следования. Написала программу на языке Си для решения конкретной задачи.
