# Отчет по лабораторной работе N 9 по курсу
# "Фундаментальная информатика"

Студентка группы: M8О-113Б, Соломатина Светлана Викторовна\
Контакты: ssolomvi@gmail.com\
Работа выполнена: 18.10.2021\
Преподаватель: Довженко Анастасия Александровна

## 1. Тема

Реккурентные соотношения

## 2. Цель работы

Составление простейшей программы на языке Си итеративного характера с целочисленными реккурентными соотношениями, задающими некоторое регулярное движение точки в целочисленной системе координат (i, j) с дискретным временем k и динамическим параметром движения l.

## 3. Задание

Вариант 9. Квадрат с длиной стороны 10, стороны квадрата параллельны осям координат, центр квадрата в точке (10, -10). Проверить, попадёт ли точка за 50 шагов в область, ограниченную этим квадратом.

## 4. Оборудование

Процессор: AMD Ryzen 5 4500U with Radeon Graphics 2.38 GHz\
ОП: 16384 Мб\
НМД: 512 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **21.04**\
Интерпретатор команд: **bash**, версия **5.1.4**.\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **/home/ssolomvi**

## 6. Идея, метод, алгоритм решения задачи

Поскольку пользоваться готовыми решениями условиями лабароторной не позволяется, прежде всего стояла задача написать функции, используемые в формулах подсчёта движения точки. После их определения написать сами формулы и цикл, который бы считал дискретное время. Кроме того, вынести константы в define и вычисление параметров i, j, l в функции, чтобы их легко было поменять для других условий. 

## 7. Сценарий выполнения работы

1. Изучить лекцию, дополнительный материал
2. Составить программу на языке Си
3. Проверить написанное на code-style
4. Подготовить и сдать отчёт

## 8. Распечатка протокола

```C
#include <stdio.h>
#include <stdlib.h>

int min(int x,int y){
    return (x < y) ? x : y;
}
int max(int x, int y){
    return (x > y) ? x : y;
}
int sign(int x){
    return (x > 0) - (x < 0);
}
int mod(int x, int y){
    return abs(((x % y) + y) % y);
}
_Bool in_area(int x,int y){
    return (x >= 5 && 15 >= x && y >= -15 && -5 >= y);
}
int compute_i(int i, int j, int l, int k){
    return mod((abs(max(i * (k + 5), j * (k + 6))) - abs(min(j * (k + 7), l * (k + 8)))), 20);
}
int compute_j(int i, int j, int l){
    return mod((3 - sign(i - j)) * abs(min(min(i * l + 5, j * l - 3), i * j + 6)), 25) - 7;
}
int compute_l(int i, int j, int l){
    return mod(i, 10) + mod(j, 10) + mod(l, 10);
}

int main(void) {
    int i0, j0, l0, k;
    scanf("%d%d%d", &i0, &j0, &l0);
    int i_old = i0;
    int j_old = j0;
    int l_old = l0;

    int i = i0, j = j0, l = l0;

    for (k = 0; k < 50 && !in_area(i_old, j_old); ++k){
        i = compute_i(i_old, j_old, l_old, k);
        j = compute_j(i_old, j_old, l_old);
        l = compute_l(i_old, j_old, l_old);

        i_old = i;
        j_old = j;
        l_old = l;
    }
    printf("%s\n", in_area(i, j) ? "Yes" : "No");
    printf("%d %d %d %d\n", i, j, l, k);
    return 0;
}
```

## 9. Дневник отладки

| №  | Лаб. или дом. | Дата       | Время | Событие   | Действие по исправлению | Примечание          |
|----|---------------|------------|-------|-----------|-------------------------|---------------------|
| 0  | Дом.          | --.--.202- | 21:30 | --        | --                      | Всё прошло исправно |

## 10. Замечания автора по существу работы

Разобраться в условиях заняло 30% времени. Блюдение code-style и дополнительных условий было для меня самой трудной частью этой лабораторной работы и, наверное, потому отняло 50% времени.

## 11. Выводы

Несмотря на ограничение на использование библиотек, работа в целом понравилась. Предполагаю, что самостоятельно знакомясь даже с такими базовыми конструкциями, как, например, взятие числа или деление по модулю, границы знаний (в том числе языка Си) немного расширяются.\
Ознакомилась с реккурентными соотношениями, научилась создавать функции в языке Си, пользоваться циклами. Написала программу на языке Си, в которой используются реккурентные соотношения.

