# Отчет по лабораторной работе N 15 по курсу
# "Фундаментальная информатика"

Студентка группы: M8О-113Б, Соломатина Светлана Викторовна\
Контакты: ssolomvi@gmail.com\
Работа выполнена: 28.11.2021\
Преподаватель: Довженко Анастасия Александровна

## 1. Тема

Обработка матриц

## 2. Цель работы

Составить программу на языке Си, производящую обработку квадратной матрицы порядка NxN (1 <= N <= 8), из целых чисел

## 3. Задание

Вариант 2. Замена всех максимальных элементов матрицы на число столбцов, содержащих её минимальный элемент

## 4. Оборудование

Процессор: AMD Ryzen 5 4500U with Radeon Graphics 2.38 GHz\
ОП: 16384 Мб\
ОЗУ: 512 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **21.04**\
Интерпретатор команд: **bash**, версия **5.1.4**.\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **/home/ssolomvi**

## 6. Идея, метод, алгоритм решения задачи

С помощью цикла найти минимальный и максимальный элементы матрицы. В следующем цикле посчитать количество элементов матрицы, по значению равных миниамльному. В последнем цикле заменить элементы матрицы, равные максимальному, количеством минимальных элементов.

## 7. Сценарий выполнения работы

1. Изучить материалы лекции
2. Составить алгоритм программы
3. Написать программу для решения задания
4. Запротоколировать сеанс

*В первой строке задаются два числа — количество 0 ≤ t ≤ 50 тестов и максимальный размер n ≥ 0 матрицы, которая встретится среди тестов. \
Далее в первой строке каждого теста указан размер m ≤ n матрицы, за которым следуют не превосходящие по модулю 45 тысяч целочисленные элементы матрицы.*
| Тест  | Ввод | Вывод |
|----|:--------------|--------------:|
| 1  | 2 3<br/>3<br/>1 2 9<br/>4 9 6<br/>1 8 9<br/>1<br/>1000 | 1 2 1 <br/>4 1 6 <br/>1 8 1 <br/>1 |
| 2  | 1 2<br/>2<br/>0 0<br/>0 0 | 2 2 <br/>2 2|
| 3  | 1 5<br/> 5<br/>7 4 3 1 5<br/>5 1 3 6 2<br/>1 1 8 4 2<br/>7 4 9 2 7<br/>4 8 8 2 6 | 7 4 3 1 5 <br/>5 1 3 6 2 <br/>1 1 8 4 2 <br/>7 4 3 2 7 <br/>4 8 8 2 6  |
| 4  | 1 0<br/>0<br/>|  |
| 5  | 0 5 |  |

## 8. Распечатка протокола

```C
#include <stdio.h>

void print_m(long long size, long long matrix[size][size])
{
    for (long long i = 0; i < size; ++i) {
        for (long long j = 0; j < size; ++j) {
            printf("%lld ", matrix[i][j]);
        }
        putchar('\n');
    }
}

int main(void)
{
    long long k, kos;
    scanf("%lld%lld", &k, &kos);

    for (int q = 0; q < k; q++) {
        long long size;
        scanf("%lld", &size);
        long long array[size][size];

        for (long long i = 0; i < size; ++i) {
            for (long long j = 0; j < size; ++j) {
                scanf("%lld", &array[i][j]);
            }
        }

        long long max = array[0][0], min = array[0][0];
        long long counter = 0;

        for (long long i = 0; i < size; ++i) {
            for (long long j = 0; j < size; ++j) {
                if (array[i][j] >= max) {
                    max = array[i][j];
                }
                if (array[i][j] <= min) {
                    min = array[i][j];
                }
            }
        }

        for (long long i = 0; i < size; ++i) {
            for (long long j = 0; j < size; ++j) {
                if (array[j][i] == min) {
                    counter++;
                    break;
                }
            }
        }
        for (long long i = 0; i < size; ++i) {
            for (long long j = 0; j < size; ++j) {
                if (array[i][j] == max) {
                    array[i][j] = counter;
                }
            }
        }
        print_m(size, array);
    }
    return 0;
}
```

## 9. Дневник отладки

| №  | Лаб. или дом. | Дата       | Время | Событие   | Действие по исправлению | Примечание          |
|----|---------------|------------|-------|-----------|-------------------------|---------------------|
| 1  | Дом.          | 22.11.2021 | 20:15 | Неправильное определение минимального и максимального элемента матрицы по умолчанию| Переопределение минимального и максимального элемента матрицы по умолчанию                      | Это было не так, чтобы очевидно |

## 10. Замечания автора по существу работы

Лабораторная трудной не показалась, хотя и в ней есть свои нюансы. Беспокоит количество циклов, кажется, необходимых для решения.

## 11. Выводы

Узнала, что матрицы можно обрабатывать, научилась изменять в них данные.
Написала программу на языке Си для решения конкретной задачи.
